results/2/server1/scotty-0.9.0/DEEP.log
Benchmarking DEEP
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   161.61ms  400.79ms  16.67s    99.63%
    Req/Sec     2.40k   353.29     4.00k    87.44%
  143056 requests in 30.00s, 20.19MB read
  Socket errors: connect 0, read 0, write 0, timeout 1142
Requests/sec:   4768.47
Transfer/sec:    689.19KB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   118.37ms  235.66ms   8.60s    97.61%
    Req/Sec     3.82k     0.86k    8.80k    68.42%
  143029 requests in 30.00s, 20.19MB read
  Socket errors: connect 0, read 86, write 0, timeout 2036
Requests/sec:   4767.23
Transfer/sec:    689.01KB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   518.84ms    3.17s   26.71s    98.35%
    Req/Sec     2.45k   508.62     4.50k    81.20%
  141285 requests in 30.00s, 19.94MB read
  Socket errors: connect 0, read 183, write 0, timeout 2120
Requests/sec:   4709.40
Transfer/sec:    680.66KB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   364.39ms    2.37s   24.19s    98.77%
    Req/Sec     2.66k   496.00     5.40k    82.44%
  140779 requests in 30.00s, 19.87MB read
  Socket errors: connect 0, read 187, write 0, timeout 2491
Requests/sec:   4692.59
Transfer/sec:    678.23KB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.46s     8.34s   24.70s    86.63%
    Req/Sec     1.82k   724.66     3.69k    71.19%
  141381 requests in 30.00s, 19.96MB read
  Socket errors: connect 0, read 251, write 0, timeout 2986
Requests/sec:   4712.64
Transfer/sec:    681.12KB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   154.89ms  855.71ms  26.58s    99.56%
    Req/Sec     2.48k   449.36     3.98k    66.49%
  142256 requests in 30.00s, 20.08MB read
  Socket errors: connect 0, read 161, write 0, timeout 2879
Requests/sec:   4741.76
Transfer/sec:    685.33KB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    99.88ms  430.76ms  23.21s    99.54%
    Req/Sec     3.60k   702.85     5.22k    76.95%
  143747 requests in 30.00s, 20.29MB read
  Socket errors: connect 0, read 309, write 0, timeout 2768
Requests/sec:   4791.54
Transfer/sec:    692.53KB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   165.33ms  836.95ms  18.38s    99.45%
    Req/Sec     2.41k   288.44     3.44k    74.26%
  142751 requests in 30.00s, 20.15MB read
  Socket errors: connect 0, read 190, write 0, timeout 2586
Requests/sec:   4758.32
Transfer/sec:    687.73KB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   547.43ms    3.36s   28.64s    98.36%
    Req/Sec     2.19k   659.89     3.74k    60.00%
  143082 requests in 30.00s, 20.20MB read
  Socket errors: connect 0, read 226, write 0, timeout 2744
Requests/sec:   4769.32
Transfer/sec:    689.32KB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   661.78ms    3.01s   22.11s    97.10%
    Req/Sec     2.11k   494.82     3.96k    74.44%
  141903 requests in 30.00s, 20.03MB read
  Socket errors: connect 0, read 146, write 0, timeout 2317
Requests/sec:   4729.99
Transfer/sec:    683.63KB
=================== summary ===================
machine:      server1
ghc version:  7.8.3
bench target: scotty-0.9.0
bench:        DEEP
bench mode:   30s * 10
average:      4744.13
stdev:        32.09
=================== oneline ===================
server1,7.8.3,scotty-0.9.0,DEEP,30s,10,4744.13,32.09