results/2/server1/scotty-0.9.0/HELLO.log
Benchmarking HELLO
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/hello-world
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    16.80ms   13.73ms   1.12s    92.34%
    Req/Sec    24.05k     2.04k   30.58k    78.42%
  1402259 requests in 30.00s, 207.28MB read
  Socket errors: connect 0, read 0, write 0, timeout 95
Requests/sec:  46742.02
Transfer/sec:      6.91MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/hello-world
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    17.15ms   14.54ms   1.64s    99.05%
    Req/Sec    23.95k     2.93k   33.14k    69.56%
  1396381 requests in 30.00s, 206.41MB read
  Socket errors: connect 0, read 0, write 0, timeout 58
Requests/sec:  46545.62
Transfer/sec:      6.88MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/hello-world
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    17.11ms   12.58ms   1.56s    99.50%
    Req/Sec    23.93k     3.06k   39.16k    82.37%
  1399093 requests in 30.00s, 206.81MB read
  Socket errors: connect 0, read 0, write 0, timeout 10
Requests/sec:  46635.99
Transfer/sec:      6.89MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/hello-world
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    16.00ms   13.94ms   1.25s    89.59%
    Req/Sec    24.65k     2.74k   32.82k    71.31%
  1425828 requests in 30.00s, 210.77MB read
  Socket errors: connect 0, read 0, write 0, timeout 471
Requests/sec:  47526.92
Transfer/sec:      7.03MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/hello-world
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    17.29ms    5.03ms 642.54ms   96.97%
    Req/Sec    23.49k     1.44k   29.55k    79.41%
  1384756 requests in 30.00s, 204.69MB read
  Socket errors: connect 0, read 0, write 0, timeout 6
Requests/sec:  46158.23
Transfer/sec:      6.82MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/hello-world
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    17.15ms   13.00ms   1.58s    99.61%
    Req/Sec    23.81k     1.78k   31.58k    74.66%
  1393835 requests in 30.00s, 206.04MB read
Requests/sec:  46460.57
Transfer/sec:      6.87MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/hello-world
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    17.41ms   14.91ms   1.30s    97.90%
    Req/Sec    24.43k     6.44k   56.12k    77.44%
  1402298 requests in 30.00s, 207.29MB read
  Socket errors: connect 0, read 0, write 0, timeout 172
Requests/sec:  46743.03
Transfer/sec:      6.91MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/hello-world
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    17.16ms    3.89ms  63.61ms   81.60%
    Req/Sec    23.73k     1.45k   27.98k    73.40%
  1400071 requests in 30.00s, 206.96MB read
Requests/sec:  46668.51
Transfer/sec:      6.90MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/hello-world
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    16.56ms   11.58ms   1.34s    98.28%
    Req/Sec    24.02k     2.36k   33.52k    76.08%
  1403212 requests in 30.00s, 207.42MB read
  Socket errors: connect 0, read 0, write 0, timeout 260
Requests/sec:  46773.64
Transfer/sec:      6.91MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/hello-world
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    16.58ms   19.48ms   1.38s    98.67%
    Req/Sec    24.30k     3.87k   37.25k    64.50%
  1412960 requests in 30.00s, 208.86MB read
  Socket errors: connect 0, read 0, write 0, timeout 364
Requests/sec:  47098.65
Transfer/sec:      6.96MB
=================== summary ===================
machine:      server1
ghc version:  7.8.3
bench target: scotty-0.9.0
bench:        HELLO
bench mode:   30s * 10
average:      46735.32
stdev:        368.04
=================== oneline ===================
server1,7.8.3,scotty-0.9.0,HELLO,30s,10,46735.32,368.04